src/Documents/ЗаданиеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаРаботу</Name>
			<RegisterRecords>
				<xr:Item>InformationRegister.Пр_ПланФактовоеОтклонение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пр_Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ОценкаВGitLab</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пр_ФактВGitLab</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КалендарьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заказчик</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаданиеНаРаботу/Ext/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область ДляВызоваИзДругихПодсистем

&После("ДобавитьКомандыПечати")
Процедура Пр_ДобавитьКомандыПечати(КомандыПечати)
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТехническоеЗаданиеWord";
	КомандаПечати.Представление = НСтр("ru = 'Техническое задание (Word)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 2;
	КомандаПечати.Картинка = БиблиотекаКартинок.Word32;
	
КонецПроцедуры

&ИзменениеИКонтроль("Печать")
Процедура Пр_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаданияНаРаботу") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаданияНаРаботу", НСтр("ru = 'Задание на работу'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));

	КонецЕсли;   
	
	#Вставка
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТехническоеЗаданиеWord") Тогда
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ТехническоеЗаданиеWord");
		Если ПечатнаяФорма <> Неопределено Тогда
			ПечатнаяФорма.ОфисныеДокументы = ПечатьТехническоеЗадание(МассивОбъектов);
			ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Техническое задание (Word)'");
		КонецЕсли;
		
	КонецЕсли;
	#КонецВставки

	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, 
	КоллекцияПечатныхФорм);

КонецПроцедуры

#КонецОбласти

// Формирует соответствие офисных документов
//
// Параметры:
// МассивОбъектов - Массив
//	*Массив ссылок объектов на печать
//
// Возвращаемое значение:
// Соответствие
//
функция ПечатьТехническоеЗадание(МассивОбъектов)
	
	ОфисныеДокументы = Новый Соответствие;
	
	Шаблон = НСтр("ru = 'Техническое задание [Номер] от [Дата]'");
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "Номер, Дата", Истина);
	
	Для Каждого ТехЗадание Из МассивОбъектов Цикл
		
		РеквизитыЗадания = ЗначенияРеквизитов[ТехЗадание];
		РеквизитыЗадания.Дата = Формат(РеквизитыЗадания.Дата, "ДЛФ=DD");
		РеквизитыЗадания.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыЗадания.Номер);
		
		ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, РеквизитыЗадания);
		АдресДокумента = СформироватьТехническоеЗадание(ТехЗадание);
		
		ОфисныеДокументы.Вставить(АдресДокумента, ИмяДокумента);
		
	КонецЦикла;
	
	Возврат ОфисныеДокументы;
	
КонецФункции

// Формирует печатную форму и помещает в ВХ
//
// Параметры:
// ЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу
//
// Возвращаемое значение:
// Строка
//
Функция СформироватьТехническоеЗадание(ЗаданиеНаРаботу)
	
	МакетДокумента = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаРаботу.Пр_ПФ_DOCX_ТехническоеЗадание", "ru_RU");
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);
	
	ОписаниеОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка", "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Основное", "Общая");
	
	ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ        
		|	ЗаданиеНаРаботу.Ссылка КАК ЗаданиеНаРаботу,
		|	ЗаданиеНаРаботу.Номер КАК Номер,
		|	ЗаданиеНаРаботу.Дата КАК Дата,
		|	ЗаданиеНаРаботу.Организация КАК Организация,
		|	ЗаданиеНаРаботу.Пр_Проект КАК Проект,
		|	ЗаданиеНаРаботу.Автор КАК Автор,
		|	Проекты.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО ЗаданиеНаРаботу.Пр_Проект = Проекты.Ссылка
		|ГДЕ
		|	ЗаданиеНаРаботу.Ссылка = &ЗаданиеНаРаботу";
	
	Запрос.УстановитьПараметр("ЗаданиеНаРаботу", ЗаданиеНаРаботу);
	Результат = Запрос.Выполнить().Выгрузить();   
	Если Результат.Количество() Тогда 
		
		ДанныеДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
		ДанныеДокумента.Дата = Формат(ДанныеДокумента.Дата, "ДЛФ=DD");
		ДанныеДокумента.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокумента.Номер);
		ДанныеДокумента.Вставить("Описание", ДанныеДокумента.ЗаданиеНаРаботу.Работы[0].Комментарий);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеДокумента);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Основное"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеДокумента); 
		
		АдресВХ = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
		
		УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
		УправлениеПечатью.ОчиститьСсылки(Макет);
		
	КонецЕсли;
	
	АдресВХ = ?(ПустаяСтрока(АдресВХ), "", АдресВХ);
	Возврат АдресВХ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
